README.org
#+TITLE: My Emacs configuration
#+AUTHOR: Sergey Korolev
#+EMAIL: korolev.srg@gmail.com
#+PROPERTY: header-args:elisp :tangle "init.el" :comments org
#+OPTIONS: ^:{}

* About
This is my Emacs configuration, built with =use-package= and
=org-mode=. =use-package= allows declarative description of packages and it’s
settings, =org-mode= allows to represent this configuration as document and
generate config from it.

This file declares local variable hook - run =org-babel-tangle= on every save.

** Usage
Clone repository to =~/.emacs.d= and run Emacs.

** TODO Table of Contents                                            :TOC@3:
* Initialization
Initial bootstrapping and things related to package management.

** Header
#+begin_src elisp :comments no
  ;;; init.el -- My Emacs Configuration.
  ;;; Commentary:
  ;;; This file was tangled (automatically generated) from `README.org'
  ;;; Code:

  ;; -*- lexical-binding: t -*-

  ;; Load 'early-init on old versions
  (unless (>= emacs-major-version 27)
    (load-file
     (expand-file-name "early-init.el"
                       (file-name-directory (or load-file-name buffer-file-name)))))
#+end_src

** Early Init - performance hacks
Emacs HEAD (27+) introduces =early-init.el=, which is run before =init.el=,
before package and UI initialization happens. So, some performance hack lives here.

#+begin_src elisp :tangle "early-init.el" :comments no
  ;;; early-init.el -- My Emacs Configuration.
  ;;; Commentary:
  ;;; This file was tangled (automatically generated) from `README.org'
  ;;; Code:
  ;; -*- lexical-binding: t -*-

  ;; Defer garbage collection further back in the startup process.
  ;; Reset it later by enabling `gcmh-mode'.
  (setq gc-cons-threshold most-positive-fixnum)

  ;; In Emacs 27+, package initialization occurs before `user-init-file' is
  ;; loaded, but after `early-init-file'. We want init packages manually.
  (setq package-enable-at-startup nil)

  ;; In noninteractive sessions, prioritize non-byte-compiled source files to prevent
  ;; the use of stale byte-code. Otherwise, it saves us a little IO time to skip the
  ;; =mtime= checks on every *.elc file we load.
  (setq load-prefer-newer noninteractive)

  ;; Don't make a second case-insensitive pass over =auto-mode-alist=. If it has to,
  ;; it's our (the user's) failure. One case for all!
  (setq auto-mode-case-fold nil)

  ;; Prevent the glimpse of un-styled Emacs by disabling these UI elements early.
  (push '(menu-bar-lines . 0) default-frame-alist)
  (push '(tool-bar-lines . 0) default-frame-alist)
  (push '(vertical-scroll-bars) default-frame-alist)

  ;; Resizing the Emacs frame can be a terribly expensive part of changing the
  ;; font. By inhibiting this, we easily halve startup times with fonts that are
  ;; larger than the system default.
  (setq frame-inhibit-implied-resize t)

  ;; Ignore X resources; its settings would be redundant with the other settings
  ;; in this file and can conflict with later config (particularly where the
  ;; cursor color is concerned).
  (advice-add #'x-apply-session-resources :override #'ignore)

  ;; Remove command line options that aren't relevant to our current OS;
  ;; that means less to process at startup.
  (unless (eq system-type 'darwin) (setq command-line-ns-option-alist nil))
  (unless (eq system-type 'gnu/linux) (setq command-line-x-option-alist nil))

  ;; Don’t compact font caches during garbage collect.
  (setq inhibit-compacting-font-caches t)

  ;; Disable bidirectional text rendering for a modest performance boost. No RTL, oops.
  (setq-default bidi-display-reordering 'left-to-right)

  ;; Reduce rendering/line scan work for Emacs by not rendering cursors or regions in
  ;; non-focused windows.
  (setq-default cursor-in-non-selected-windows nil)


  (provide 'early-init)
  ;;; early-init.el ends here
#+end_src

** Update load paths
Optimize: Force =lisp= and =site-lisp= at the head to reduce the startup time.

#+begin_src elisp
  (defun update-load-path (&rest _)
    "Update `load-path'."
    (push (expand-file-name "site-lisp" user-emacs-directory) load-path)
    (push (expand-file-name "lisp" user-emacs-directory) load-path))

  (defun add-subdirs-to-load-path (&rest _)
    "Add subdirectories to `load-path'."
    (let ((default-directory
            (expand-file-name "site-lisp" user-emacs-directory)))
      (normal-top-level-add-subdirs-to-load-path)))

  (advice-add #'package-initialize :after #'update-load-path)
  (when (file-directory-p (expand-file-name "site-lisp" user-emacs-directory))
    (advice-add #'package-initialize :after #'add-subdirs-to-load-path))

  (update-load-path)
#+end_src

** Garbage collector hack
Set garbage collection threshold to the normal value on setup complete. Run GC
on idle. Don't run GC in minibuffer and run on exit.

#+begin_src elisp
  (defvar knopki/gc-cons-threshold (* 4 1024 1024)
    "The default value to use for `gc-cons-threshold'.
  If you experience freezing, decrease this.
  If you experience stuttering, increase this.")

  (add-hook 'emacs-startup-hook
            (lambda ()
              ;; Return GC cons to normal value after loading
              (setq gc-cons-threshold knopki/gc-cons-threshold)

              ;; Run GC after some idle
              (run-with-idle-timer 5 t #'garbage-collect)

              ;; Don't GC in minibuffer at all
              (add-hook 'minibuffer-setup-hook
                        (lambda () (setq gc-cons-threshold most-positive-fixnum)))

              ;; GC after minibuffer exit
              (add-hook 'minibuffer-exit-hook
                        (lambda () (setq gc-cons-threshold knopki/gc-cons-threshold)))))
#+end_src

** Initialize 'use-package
=use-package= package is the central gear of my configuration.

HACK: DO NOT copy package-selected-packages to init/custom file forcibly - [[https://github.com/jwiegley/use-package/issues/383#issuecomment-247801751][ref]]

#+begin_src elisp
  (defun my-save-selected-packages (&optional value)
    "Set `package-selected-packages' to VALUE but don't save to `custom-file'."
    (when value
      (setq package-selected-packages value)))
  (advice-add 'package--save-selected-packages :override #'my-save-selected-packages)
#+end_src

Setup package archives.

#+begin_src elisp
  (require 'package)
  (customize-set-variable 'package-archives
        (append (eval (car (get 'package-archives 'standard-value)))
                '(("org" . "http://orgmode.org/elpa/")
                  ("gnu"          . "https://elpa.gnu.org/packages/")
                  ("melpa" . "http://melpa.org/packages/"))))
#+end_src

Initialize packages.

#+begin_src elisp
  (unless (bound-and-true-p package--initialized) ; To avoid warnings in 27
    (setq package-enable-at-startup nil)          ; To prevent initializing twice
    (package-initialize))
#+end_src

Setup =use-package=.

#+begin_src elisp
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  ;; Should set before loading `use-package'
  (eval-and-compile
    (setq use-package-always-ensure t))

  (eval-when-compile
    (require 'use-package))

  ;; Required by `use-package'
  (use-package diminish)
  (use-package bind-key)
#+end_src

Update GPG keyring for GNU ELPA.

#+begin_src elisp
  (use-package gnu-elpa-keyring-update)
#+end_src

** Benchmarking
Enable startup benchmarking if started with =EMACS_BENCHMARK= environment
variable is set.

#+begin_src elisp
  (when (getenv "EMACS_BENCHMARK")
    (use-package benchmark-init
      :defines swiper-font-lock-exclude
      :commands (benchmark-init/activate)
      :hook (after-init . benchmark-init/deactivate)
      :init (benchmark-init/activate)
      :config
      (setq use-package-compute-statistics t)
      (with-eval-after-load 'swiper
        (add-to-list 'swiper-font-lock-exclude 'benchmark-init/tree-mode))))
#+end_src
** Setup standard file paths
The default paths used to store configuration files and persistent data are not
consistent across Emacs packages. This package sets out to fix this by changing
the values of path variables to put configuration files in
no-littering-etc-directory (defaulting to =~/.emacs.d/etc/=) and persistent data
files in no-littering-var-directory (defaulting to =~/.emacs.d/var/=), and by
using descriptive file names and subdirectories when appropriate.

#+begin_src elisp
  (use-package no-littering :demand)
#+end_src

* Essential settings
** Emacs variables that defined in C source code
#+begin_src elisp
  (use-package emacs
    :ensure nil
    :demand
    :init
    ;; UTF-8 as the default coding system.
    (when (fboundp 'set-charset-priority)
      (set-charset-priority 'unicode))       ; pretty
    (prefer-coding-system 'utf-8)            ; pretty
    (setq locale-coding-system 'utf-8)       ; please
    (unless (eq system-type 'windows-nt)
      (setq selection-coding-system 'utf-8)) ; with sugar on top

    (fset #'display-startup-echo-area-message #'ignore)
    :hook
    ;; Favor hard-wrapping in text modes.
    (text-mode . auto-fill-mode)

    ;; Keep cursor from getting stuck in the read-only prompt
    (minibuffer-setup-hook . cursor-intangible-mode)

    :custom
    (use-file-dialog nil "File dialogs via minibuffer only.")
    (use-dialog-box nil "Dialogs via minibuffer only.")


    (truncate-lines t "Truncate long lines.")
    (truncate-partial-width-windows nil "Truncate lines without magic.")

    ;; Tab and Space. Permanently indent with spaces, never with TABs.
    (tab-width 4 "Sane default.")
    (indent-tabs-mode nil "Tabs are evil.")
    (fill-column 80 "Wrap line at 80.")

    (delete-by-moving-to-trash t "Deleting files go to OS's trash folder.")

    (ffap-machine-p-known 'reject "Don't ping.")

    ;; Menu/Tool/Scroll bars
    (hscroll-step 1 "How many colums scroll when points get too close to the edge.")
    (scroll-step 1 "How many lines scroll when point moves out.")
    (scroll-margin 5 "Number of lines of margin at the top & bottom.")
    (scroll-conservatively 10 "Scroll up to this many lines.")
    (scroll-preserve-screen-position t)
    ;; Reduce cursor lag by a tiny bit by not auto-adjusting `window-vscroll'
    ;; for tall lines.
    (auto-window-vscroll nil)
    ;; More performant rapid scrolling over unfontified regions. May cause brief
    ;; spells of inaccurate fontification immediately after scrolling.
    (fast-but-imprecise-scrolling t)
    ;; Disable help mouse-overs for mode-line segments (i.e. :help-echo text).
    ;; They're generally unhelpful and only add confusing visual clutter.
    (mode-line-default-help-echo nil)
    (show-help-function nil)

    (visible-cursor nil "Don't make cursor very visible.")
    (visible-bell t "Flash frame to represent a bell.")

    ;; Try really hard to keep the cursor from getting stuck in the read-only prompt
    ;; portion of the minibuffer.
    (minibuffer-prompt-properties
     '(read-only t intangible t cursor-intangible t face minibuffer-prompt))

    (x-gtk-use-system-tooltips nil "Don't use GTK+ tooltip.")

    (window-resize-pixelwise t "Don't resize in steps.")
    (frame-resize-pixelwise t "Don't resize in steps.")

    (split-height-threshold nil "Favor vertical splits over horizontal ones.")

    (echo-keystrokes 0.02 "Echo key-sequence in minibuffer, like VIM does.")

    ;; Expand the minibuffer to fit multi-line text displayed in the echo-area. This
    ;; doesn't look too great with direnv, however...
    (resize-mini-windows 'grow-only)
    ;; But don't let the minibuffer grow beyond this size
    (max-mini-window-height 0.15)

    (x-underline-at-descent-line t "Underline looks a bit better when drawn lower.")

    (indicate-empty-lines t "Visually indicate empty lines.")
    (indicate-buffer-boundaries 'left "Show buffer boundaries at left fringe.")

    ;; Display the bare minimum at startup. We don't need all that noise.
    ;; The dashboard/empty scratch buffer is good enough.
    (inhibit-default-init t "Don't load default font family.")
    (inhibit-startup-screen t "Don't show startup screen.")
    (inhibit-startup-echo-area-message t "Don't echo messages.")
    (inhibit-splash-screen t "Don't show the splash screen.")
    (initial-scratch-message nil "Disable initial scratch message.")
    (initial-major-mode 'text-mode "It just text by default.")

    (history-length 1000 "Max length of history lists.")
    (history-delete-duplicates t "Delete dups in history."))
#+end_src

